Revit 2027 API
BuiltInFailures.CreationFailures.CannotDrawWallsError Property
 Can't make Wall.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotDrawWallsError { get; }
Public Shared ReadOnly Property CannotDrawWallsError As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotDrawWallsError {
	FailureDefinitionId^ get ();
}
static member CannotDrawWallsError : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.CreationFailures Class
Autodesk.Revit.DB Namespace